#include <stdio.h>

int main() {
    int n; // Оголошення змінної
    printf("Enter the length of the sequences n (1 < n < 10000): "); // Підказка для користувача, яке саме значення треба ввести
    scanf("%d", &n); //

    while (n < 1 || n > 10000) // У разі, якщо значення користувача не задовільняє умову, то він потрапить у цикл, з якого можна вийти лише тоді, коли значення буде задовільняти
    {
        printf("!!! Invalid value !!!\n*Your number must be from 1 to 10000*\n");
        printf("Enter the length of the sequences n (1 < n < 10000): ");
        scanf("%d", &n);
    }
    

    int dp[n+1]; // Оголошення масиву для зберігання допустимих послідовностей
    dp[0] = 1; // Якщо послідовність порожня
    dp[1] = 2; // Базовий випадок №1 (0 та 1)
    dp[2] = 4; // Базовий випадок №2 (00, 01, 10, 11)

    for (int i = 3; i <= n; i++) // Цикл, який обчислює кількість допустимих значень
    {
        dp[i] = dp[i-1] + dp[i-2] + dp[i-3];
    }

    printf("Number of valid sequences of length %d: %d\n", n, dp[n]); // Виведення результату на еркан

    return 0;
}
