#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    float x1, y1, x2, y2; // Оголошення змінних

    printf("Value x1: "); // Підказка для користувача, треба ввести значення для координати х1
    scanf("%f", &x1); // Сканування з клавіатури
    printf("Value y1: "); // Підказка для користувача, треба ввести значення для координати у1 
    scanf("%f", &y1); // Сканування з клавіатури
    printf("Value x2: "); // Підказка для користувача, треба ввести значення для координати х2
    scanf("%f", &x2); // Сканування з клавіатури
    printf("Value y2: "); // Підказка для користувача, треба ввести значення для координати у2
    scanf("%f", &y2); // Сканування з клавіатури

    float dx = x2 - x1; // Обчислення різниці координат для значень х
    float dy = y2 - y1; // Обчислення різниці координат для значень у

    float result = sqrt(pow(dx,2) + pow(dy, 2)); // Обчислення довжини вектора за формолую, наданою в теоретичних відомостях

    printf("Vector's lenth: %.6f", result); // Виведення результату на екран
}